#Необходимо по полученным результатам тарификации услуг
#«Телефония» и «Интернет» в лабораторных работах 1, 2 
#сформировать счет на оплату в формате .pdf
from reportlab.pdfbase import pdfmetrics
from reportlab.pdfbase.ttfonts import TTFont
from reportlab.platypus import SimpleDocTemplate, Table, TableStyle
from reportlab.lib.pagesizes import A4
from reportlab.lib import colors


internetcount = 168.00
phonecount = 36.23
smscount = 15.00

internetprice = 84.00
phoneprice = 10
smsprice = 67.46

price = internetprice + phoneprice + smsprice
price = float('{:.2f}'.format(price))

pdf_file = 'Invoice.pdf'
data_1 = [
    ['Филиал Рокетбанк КИВИ Банк (АО)\n\n\nБанк получателя'            , ''          , '', '', ''             , ''         , '', '', 'БИК'  , '044525420'                     , '', '', ''],
    [''                                             , ''          , '', '', ''             , ''         , '', '', 'Сч. №', ' 30101810945250000420\n\n'      , '', '', ''],
    [''                                             , ''          , '', '', ''             , ''         , '', '', ''     , ''                              , '', '', ''],
    ['ИНН 3123011520'                               , ''          , '', '', 'КПП 772643002', ''         , '', '', 'Сч. №', '40817810560000224015\n\n\n\n\n', '', '', ''],
    ['ИП "Хачикян"\n\n\nПолучатель'                 , ''          , '', '', ''             , ''         , '', '', ''     , ''                              , '', '', ''],
    [''                                             , ''          , '', '', ''             , ''         , '', '', ''     , ''                              , '', '', ''],
    [''                                             , ''          , '', '', ''             , ''         , '', '', ''     , ''                              , '', '', '']
]

data_2 = [
    ['Счет на оплату № 1 от 05 июня 2020 г.', '', ''                                                           , '', '', '', '', '', '', '', '', '', ''],
    [''                                    , '', ''                                                           , '', '', '', '', '', '', '', '', '', ''],
    ['Поставщик'                           , '', 'ИП "Хачикян", ИНН 2442744772, КПП 244274477, 244291, г. Санкт-Петербург,'                                                       , '', '', '', '', '', '', '', '', '', ''],
    ['(Исполнитель):'                      , '', 'ул. Думская, дом №4, помещение 15'                                                        , '', '', '', '', '', '', '', '', '', ''],
    [''                                    , '', ''                                                           , '', '', '', '', '', '', '', '', '', ''],
    ['Покупатель'                          , '', 'Хачикян Гарри Гурамович, ИНН 7447244272, г. Санкт-Петербург', '', '', '', '', '', '', '', '', '', ''],
    ['(Заказчик):'                         , '', ''                                                           , '', '', '', '', '', '', '', '', '', ''],
    [''                                    , '', ''                                                           , '', '', '', '', '', '', '', '', '', ''],
    ['Основание:'                          , '', 'Договор № 151515 от 01.01.2020'                           , '', '', '', '', '', '', '', '', '', '']
]
data_3 = [
    ['№', 'Товары (работы, услуги)'  , '', '', '', '', 'Кол-во', 'Ед.', 'Цена'    , '', 'Сумма'   , '', ''],
    ['1', 'Плата за услуги Интернет' , '', '', '', '',	'168', 'Мб' , '0.5 руб./Мб.', '', internetprice,'', ''],
    ['2', 'Плата за услуги Телефония', '', '', '', '',	'36.23', 'Мин' , '0.5 руб./мин.' , '', phoneprice  , '', ''],
    ['3', 'Плата за услуги SMS'      , '', '', '', '',	'15', 'шт' , '1 руб./шт.'   , '', smsprice   , '', '']
]
data_4 = [
    [''                                                                          , '', '', '', '', '', '', '', 'Итого:'          , '', '', price        , ''],
    [''                                                                          , '', '', '', '', '', '', '', 'В том числе НДС:', '', '', (price * 0.2), ''],
    [''                                                                          , '', '', '', '', '', '', '', 'Всего к оплате:' , '', '', price        , ''],
    ['Всего наименований 3, на сумму {} руб.'.format(str(price)), '', '', '', '', '', '', '', ''                , '', '', ''                                 , ''],
    ['Сто шестьдесят один рубль сорок шесть копеек'                      , '', '', '', '', '', '', '', ''                , '', '', ''                                 , '']
]
data_5 = [
    ['Примечание:'                                                                                          , '', ''                , '', '', '', ''         , '', ''                , '', '', '', ''],
    ['Оплата данного счета означает согласие с условиями поставки услуг.'                                , '', ''                , '', '', '', ''         , '', ''                , '', '', '', ''],
    ['Уведомление об оплате обязательно, в противном случае не гарантируется поставка услуг.'   , '', ''                , '', '', '', ''         , '', ''                , '', '', '', ''],
    ['Услуги поставляются по факту прихода денег на р/с поставщика', '', ''                , '', '', '', ''         , '', ''                , '', '', '', ''],
    [''                                                                                          , '', ''                , '', '', '', ''         , '', ''                , '', '', '', ''],
    [''                                                                                                   , '', ''                , '', '', '', ''         , '', ''                , '', '', '', ''],
    [''                                                                                                   , '', ''                , '', '', '', ''         , '', ''                , '', '', '', ''],
    ['Руководитель'                                                                                       , '', 'Хачикян Г.Г.', '', '', '', 'Бухгалтер', '', 'Хачикян Г.Г.', '', '', '', '']
]

def create_pdf():

    pdfmetrics.registerFont(TTFont('FreeSans', 'FreeSans.ttf'))
	
    pdf = SimpleDocTemplate(
        filename= pdf_file,
        pagesize=A4
    )
    
    table_1 = Table(data_1, colWidths=[40 for i in range(13)])
    
    style_1 = TableStyle([
        ('SPAN', (0, 0), (7, 2)),
        ('SPAN', (0, 3), (3, 3)), ('SPAN', (4, 3), (7, 3)),
        ('SPAN', (0, 4), (7, 6)),
        ('SPAN', (8, 1), (8, 2)),
        ('SPAN', (8, 3), (8, 6)),
        ('SPAN', (9, 0), (11, 0)),
        ('SPAN', (9, 1), (11, 2)),
        ('SPAN', (9, 3), (11, 6)),

        ('FONTNAME', (0, 0), (-2, -1), 'FreeSans'),
        ('BOX',  (0, 0), (-2, -1), 0.5, colors.black),
        ('GRID', (0, 0), (-2, -1), 0.5, colors.black),
        ('VALIGN', (8, 0), (8, 6), 'TOP')
    ])
    table_1.setStyle(style_1)
    
	
    table_2 = Table(data_2, colWidths=[40 for i in range(13)])
    
    style_2 = TableStyle([
        ('SPAN', (0, 0), (11, 1)),

        ('FONTNAME', (0, 0), (-2, 1), 'FreeSans'),
        ('FONTSIZE', (0, 0), (-2, 1), 18),
        ('VALIGN',   (0, 0), (-2, 1), 'TOP'),
        ('LINEABOVE', (0, 2), (-2, 2), 2, colors.black),
        ('TOPPADDING', (0, 2), (-2, 2), 10),
        ('FONTNAME', (0, 2), (0, -1), 'FreeSans'),
        ('FONTNAME', (2, 2), (-2, -1), 'FreeSans'),
        ('BOTTOMPADDING', (0, -1), (-2, -1), 20)
    ])
    table_2.setStyle(style_2)
    

    table_3 = Table(data_3, colWidths=[40 for i in range(13)])
    
    style_3 = TableStyle([
        ('SPAN', (0, 0), (0, 0)), ('SPAN', (1, 0), (5, 0)), ('SPAN', (6, 0), (6, 0)), ('SPAN', (7, 0), (7, 0)), ('SPAN', (8, 0), (9, 0)), ('SPAN', (10, 0), (11, 0)),
        ('SPAN', (0, 1), (0, 1)), ('SPAN', (1, 1), (5, 1)), ('SPAN', (6, 1), (6, 1)), ('SPAN', (7, 1), (7, 1)), ('SPAN', (8, 1), (9, 1)), ('SPAN', (10, 1), (11, 1)),
        ('SPAN', (0, 2), (0, 2)), ('SPAN', (1, 2), (5, 2)), ('SPAN', (6, 2), (6, 2)), ('SPAN', (7, 2), (7, 2)), ('SPAN', (8, 2), (9, 2)), ('SPAN', (10, 2), (11, 2)),
        ('SPAN', (0, 3), (0, 3)), ('SPAN', (1, 3), (5, 3)), ('SPAN', (6, 3), (6, 3)), ('SPAN', (7, 3), (7, 3)), ('SPAN', (8, 3), (9, 3)), ('SPAN', (10, 3), (11, 3)),

        ('FONTNAME', (0, 0), (-2, 0), 'FreeSans'),
        ('ALIGN', (0, 0), (-2, 0), 'CENTER'),
        ('FONTNAME', (0, 1), (-2, -1), 'FreeSans'),
        ('BOX',  (0, 0), (-2, -1), 1, colors.black),
        ('GRID', (0, 0), (-2, -1), 0.5, colors.black),
        ('ALIGN', (0, 1), (0, -1), 'CENTER')
    ])
    table_3.setStyle(style_3)
    
	
    table_4 = Table(data_4, colWidths=[40 for i in range(13)])
    
    style_4 = TableStyle([
        ('SPAN', (0, 0), (0, 0)),

        ('TOPPADDING', (0, 0), (-2, 0), 10),
        ('FONTNAME', (0, 0), (-2, 2), 'FreeSans'),
        ('FONTNAME', (0, 3), (-2, 3), 'FreeSans'),
        ('FONTNAME', (0, 4), (-2, 4), 'FreeSans')
    ])
    table_4.setStyle(style_4)
    

    table_5 = Table(data_5, colWidths=[40 for i in range(13)])
    
    style_5 = TableStyle([
        ('SPAN', (0, -1), (1, -1)), ('SPAN', (6, -1), (7, -1)),

        ('TOPPADDING', (0, 0), (-2, 0), 20),
        ('FONTNAME', (0, 0), (-2, -1), 'FreeSans'),
        ('LINEABOVE', (0, -2), (-2, -2), 2, colors.black),
        ('LINEBELOW', (2, -1), (5, -1), 0.5, colors.black),
        ('LINEBELOW', (8, -1), (11, -1), 0.5, colors.black),
        ('ALIGN', (0, -1), (1, -1), 'RIGHT'),
        ('ALIGN', (6, -1), (7, -1), 'RIGHT')
    ])
    table_5.setStyle(style_5)
    
    
    elems = []
    elems.append(table_1)
    elems.append(table_2)
    elems.append(table_3)
    elems.append(table_4)
    elems.append(table_5)
    
    pdf.build(elems)

create_pdf()
